app/controllers/admin/movies_controller.rb

INSERT INTO "movies" ("title", "description", "url", "image_url", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "x"], ["description", "x"], ["url", "x"], ["image_url", "x"], ["author", "x"], ["created_at", "2015-11-03 01:03:59.990901"], ["updated_at", "2015-11-03 01:03:59.990901"]]
---
  def create
    @movie = Movie.new(movie_params)
    if @movie.save

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "url" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["url", "http://www.youtube.com/embed/5AxwaszFbDw"], ["updated_at", "2015-11-03 01:22:03.070491"], ["id", 1]]
---
  def update
    @movie = Movie.find(params[:id])
    if @movie.update_attributes(movie_params)

DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 2]]
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
---
  def destroy
    Movie.find(params[:id]).destroy