app/controllers/playlists_controller.rb

SELECT "playlists".* FROM "playlists"
---
  def index
    @playlist = Playlist.all

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    @playlist = Playlist.find(params[:id])

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies"
---
  def edit
    @playlist = Playlist.find(params[:id])
    @movies = Movie.all

INSERT INTO "playlists" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Moja pierwsza Playlista"], ["description", "Numer 1!"], ["created_at", "2015-11-22 16:30:54.511202"], ["updated_at", "2015-11-22 16:30:54.511202"]]
---
  def create
    @playlist = Playlist.new(playlist_params) #A moze playlist params zmienic?

      if @playlist.save

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    @playlist = Playlist.find(params[:id])

DELETE FROM "playlists" WHERE "playlists"."id" = ?  [["id", 1]]
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT 1  [["id", 1]]
---
  def destroy
      @playlist = Playlist.find(params[:id]).destroy