app/controllers/users_controller.rb

INSERT INTO "users" ("login", "email", "password", "confirm_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["login", "muniek"], ["email", "zaba@cos.com"], ["password", "zaba"], ["confirm_password", "zaba"], ["created_at", "2015-10-25 08:50:37.789265"], ["updated_at", "2015-10-25 08:50:37.789265"]]
---
	def create
		@user = User.new(user_params)
		if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "email" = ?, "password" = ?, "confirm_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "gfhfhg@com"], ["password", "monia"], ["confirm_password", "monia"], ["updated_at", "2015-10-25 10:41:13.863880"], ["id", 10]]
---
	def update
		@user = User.find(params[:id])
		if @user.update(user_params)